s60sc/ESP32-CAM_MJPEG2SD/src/utils.cpp
void doRestart(const char* restartStr) {
  LOG_ALT("Controlled restart: %s", restartStr);
#ifdef ISCAM
  appShutdown();
#endif
#if INCLUDE_MQTT
  if (mqtt_active) stopMqttClient();
#endif  
  resetCrashLoop();
  flush_log(true);
  delay(2000);
  ESP.restart();
}

static void sleepTimer(bool startCycle) {
  // go into deep sleep for defined time
  // maximum sleep time is c. 2 hours, so multiple sleep cycles needed for long durations
  if (startCycle) remainingSeconds = deepSleepTimer;
  if (remainingSeconds > 0) {
    uint32_t sleepNow = min(remainingSeconds, (uint32_t)3600); // use 1 hour (3600 secs)  as sleep cycle duration
    remainingSeconds -= sleepNow;
    esp_sleep_enable_timer_wakeup((uint64_t)sleepNow * 1000000ULL); // in micro secs
    esp_deep_sleep_start();
  }
}

void goToSleep(bool deepSleep) {
#if !CONFIG_IDF_TARGET_ESP32C3
  // if deep sleep, restarts with reset
  // if light sleep, restarts by continuing this function
  LOG_INF("Going into %s sleep", deepSleep ? "deep" : "light");
  delay(100);
  if (deepSleep) { 
    if (wakePin >= 0) {
      // wakeup on pin low (0) or high (1)
      // needs to be RTC pin and support input pullup/down
      // Boot button can be used as manual wake pin
      // To use LDR or TDR on wake pin, connect it between pin and 3V3
      // uses internal pulldown resistor as voltage divider
      // but may need to add external pull down between pin
      // and GND to alter required level for wakeup
      pinMode(wakePin, wakeLevel == 0 ? INPUT_PULLUP : INPUT_PULLDOWN);
      esp_sleep_enable_ext0_wakeup((gpio_num_t)wakePin, wakeLevel);
      esp_deep_sleep_start();
    } else if (deepSleepTimer) sleepTimer(true); // use timer
    // no action if no wake pin or timer
  } else {
    // light sleep
    esp_wifi_stop();
    // wakeup on selected pin
    if (wakePin >= 0) gpio_wakeup_enable((gpio_num_t)wakePin, wakeLevel == 0 ? GPIO_INTR_LOW_LEVEL : GPIO_INTR_HIGH_LEVEL); 
    esp_light_sleep_start();
  }
  // light sleep restarts here
  LOG_INF("Light sleep wakeup");
  if (netMode != 1) esp_wifi_start();
#else
  LOG_WRN("This function not compatible with ESP32-C3");
#endif
}

bool utilsStartup() {
  bool res = false;
  sleepTimer(false);
#if CONFIG_IDF_TARGET_ESP32S3
  STACK_MEM = psramFound() ? MALLOC_CAP_SPIRAM : MALLOC_CAP_INTERNAL;
#else
  // Original ESP32 must use internal memory for stacks
  STACK_MEM = MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT;
#endif
  logSetup();
  configTzTime(timezone, ntpServer);
#ifdef NEED_PSRAM
  if (psramFound()) {
    if (ESP.getPsramSize() < MIN_PSRAM * ONEMEG) 
      snprintf(startupFailure, SF_LEN, STARTUP_FAIL "App needs at least %dMB PSRAM", MIN_PSRAM);
  } else snprintf(startupFailure, SF_LEN, STARTUP_FAIL "Need PSRAM to be enabled");
#endif
  
  prepInternalTemp();
  if (jsonBuff == NULL) jsonBuff = psramFound() ? (char*)ps_malloc(JSON_BUFF_LEN) : (char*)malloc(JSON_BUFF_LEN);
  LOG_INF("Compiled with arduino-esp32 v%s", ESP_ARDUINO_VERSION_STR);
  // prep storage
  res = startStorage();
  // Load saved user configuration
  if (res) res = loadConfig();
#ifdef DEV_ONLY
  devSetup();
#endif
  if (statusCheckHandle == NULL) {
    if (!strcmp(storageType, "SD_MMC")) xTaskCreateWithCaps(&statusCheckTask, "statusCheckTask", STATUS_STACK_SIZE, NULL, STATUS_PRI, &statusCheckHandle, STACK_MEM);
    else xTaskCreate(&statusCheckTask, "statusCheckTask", STATUS_STACK_SIZE, NULL, STATUS_PRI, &statusCheckHandle); // cant use PSRAM as SPI conflict with flash storage
  } 
  return res;
}